deneyapkart/deneyapkart-arduino-core/boards.txt
dydk1a_mpv20.menu.CPUFreq.240=240MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.240.build.f_cpu=240000000L
dydk1a_mpv20.menu.CPUFreq.160=160MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.160.build.f_cpu=160000000L
dydk1a_mpv20.menu.CPUFreq.80=80MHz (WiFi)
dydk1a_mpv20.menu.CPUFreq.80.build.f_cpu=80000000L
dydk1a_mpv20.menu.CPUFreq.40=40MHz
dydk1a_mpv20.menu.CPUFreq.40.build.f_cpu=40000000L
dydk1a_mpv20.menu.CPUFreq.20=20MHz
dydk1a_mpv20.menu.CPUFreq.20.build.f_cpu=20000000L
dydk1a_mpv20.menu.CPUFreq.10=10MHz
dydk1a_mpv20.menu.CPUFreq.10.build.f_cpu=10000000L

dydk1a_mpv20.menu.UploadSpeed.921600=921600
dydk1a_mpv20.menu.UploadSpeed.921600.upload.speed=921600
dydk1a_mpv20.menu.UploadSpeed.115200=115200
dydk1a_mpv20.menu.UploadSpeed.115200.upload.speed=115200
dydk1a_mpv20.menu.UploadSpeed.256000.windows=256000
dydk1a_mpv20.menu.UploadSpeed.256000.upload.speed=256000
dydk1a_mpv20.menu.UploadSpeed.230400.windows.upload.speed=256000
dydk1a_mpv20.menu.UploadSpeed.230400=230400
dydk1a_mpv20.menu.UploadSpeed.230400.upload.speed=230400
dydk1a_mpv20.menu.UploadSpeed.460800.linux=460800
dydk1a_mpv20.menu.UploadSpeed.460800.macosx=460800
dydk1a_mpv20.menu.UploadSpeed.460800.upload.speed=460800
dydk1a_mpv20.menu.UploadSpeed.512000.windows=512000
dydk1a_mpv20.menu.UploadSpeed.512000.upload.speed=512000

dydk1a_mpv20.menu.DebugLevel.none=None
dydk1a_mpv20.menu.DebugLevel.none.build.code_debug=0
dydk1a_mpv20.menu.DebugLevel.error=Error
dydk1a_mpv20.menu.DebugLevel.error.build.code_debug=1
dydk1a_mpv20.menu.DebugLevel.warn=Warn
dydk1a_mpv20.menu.DebugLevel.warn.build.code_debug=2
dydk1a_mpv20.menu.DebugLevel.info=Info
dydk1a_mpv20.menu.DebugLevel.info.build.code_debug=3
dydk1a_mpv20.menu.DebugLevel.debug=Debug
dydk1a_mpv20.menu.DebugLevel.debug.build.code_debug=4
dydk1a_mpv20.menu.DebugLevel.verbose=Verbose
dydk1a_mpv20.menu.DebugLevel.verbose.build.code_debug=5

dydk1a_mpv20.menu.EraseFlash.none=Disabled
dydk1a_mpv20.menu.EraseFlash.none.upload.erase_cmd=
dydk1a_mpv20.menu.EraseFlash.all=Enabled
dydk1a_mpv20.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

dydk1a_mpv30.name=Deneyap Kart 1A v3

dydk1a_mpv30.vid.0=0x303a #! burası değişebilir
dydk1a_mpv30.pid.0=0x8147

dydk1a_mpv30.bootloader.tool=esptool_py
dydk1a_mpv30.bootloader.tool.default=esptool_py

dydk1a_mpv30.upload.tool=esptool_py
dydk1a_mpv30.upload.tool.default=esptool_py
dydk1a_mpv30.upload.tool.network=esp_ota

dydk1a_mpv30.upload.maximum_size=1310720
dydk1a_mpv30.upload.maximum_data_size=327680
dydk1a_mpv30.upload.flags=
dydk1a_mpv30.upload.extra_flags=
dydk1a_mpv30.upload.use_1200bps_touch=false
dydk1a_mpv30.upload.wait_for_upload_port=false

dydk1a_mpv30.serial.disableDTR=false
dydk1a_mpv30.serial.disableRTS=false

dydk1a_mpv30.build.tarch=xtensa
dydk1a_mpv30.build.bootloader_addr=0x0
dydk1a_mpv30.build.target=esp32s3
dydk1a_mpv30.build.mcu=esp32s3
dydk1a_mpv30.build.core=esp32
dydk1a_mpv30.build.variant=dydk1a_mpv30
dydk1a_mpv30.build.board=DYDK1Av3

dydk1a_mpv30.build.usb_mode=1
dydk1a_mpv30.build.cdc_on_boot=1 #0 bakılmalı
dydk1a_mpv30.build.msc_on_boot=0
dydk1a_mpv30.build.dfu_on_boot=0
dydk1a_mpv30.build.f_cpu=240000000L
dydk1a_mpv30.build.flash_size=4MB
dydk1a_mpv30.build.flash_freq=80m
dydk1a_mpv30.build.flash_mode=dio
dydk1a_mpv30.build.boot=qio
dydk1a_mpv30.build.boot_freq=80m
dydk1a_mpv30.build.partitions=default
dydk1a_mpv30.build.defines=-DBOARD_HAS_PSRAM #burası bos
dydk1a_mpv30.build.loop_core=
dydk1a_mpv30.build.event_core=
dydk1a_mpv30.build.psram_type=opi
dydk1a_mpv30.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
dydk1a_mpv30.menu.JTAGAdapter.default=Disabled
dydk1a_mpv30.menu.JTAGAdapter.default.build.copy_jtag_files=0
dydk1a_mpv30.menu.JTAGAdapter.builtin=Integrated USB JTAG
dydk1a_mpv30.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
dydk1a_mpv30.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
dydk1a_mpv30.menu.JTAGAdapter.external=FTDI Adapter
dydk1a_mpv30.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
dydk1a_mpv30.menu.JTAGAdapter.external.build.copy_jtag_files=1
dydk1a_mpv30.menu.JTAGAdapter.bridge=ESP USB Bridge
dydk1a_mpv30.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
dydk1a_mpv30.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

dydk1a_mpv30.menu.PSRAM.opi=OPI PSRAM
dydk1a_mpv30.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
dydk1a_mpv30.menu.PSRAM.opi.build.psram_type=opi
dydk1a_mpv30.menu.PSRAM.disabled=Disabled
dydk1a_mpv30.menu.PSRAM.disabled.build.defines=
dydk1a_mpv30.menu.PSRAM.disabled.build.psram_type=qspi
dydk1a_mpv30.menu.PSRAM.enabled=QSPI PSRAM
dydk1a_mpv30.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
dydk1a_mpv30.menu.PSRAM.enabled.build.psram_type=qspi

dydk1a_mpv30.menu.FlashMode.qio=QIO 80MHz
dydk1a_mpv30.menu.FlashMode.qio.build.flash_mode=dio
dydk1a_mpv30.menu.FlashMode.qio.build.boot=qio
dydk1a_mpv30.menu.FlashMode.qio.build.boot_freq=80m
dydk1a_mpv30.menu.FlashMode.qio.build.flash_freq=80m
dydk1a_mpv30.menu.FlashMode.qio120=QIO 120MHz
dydk1a_mpv30.menu.FlashMode.qio120.build.flash_mode=dio
dydk1a_mpv30.menu.FlashMode.qio120.build.boot=qio
dydk1a_mpv30.menu.FlashMode.qio120.build.boot_freq=120m
dydk1a_mpv30.menu.FlashMode.qio120.build.flash_freq=80m
dydk1a_mpv30.menu.FlashMode.dio=DIO 80MHz
dydk1a_mpv30.menu.FlashMode.dio.build.flash_mode=dio
dydk1a_mpv30.menu.FlashMode.dio.build.boot=dio
dydk1a_mpv30.menu.FlashMode.dio.build.boot_freq=80m
dydk1a_mpv30.menu.FlashMode.dio.build.flash_freq=80m
dydk1a_mpv30.menu.FlashMode.opi=OPI 80MHz
dydk1a_mpv30.menu.FlashMode.opi.build.flash_mode=dout
dydk1a_mpv30.menu.FlashMode.opi.build.boot=opi
dydk1a_mpv30.menu.FlashMode.opi.build.boot_freq=80m
dydk1a_mpv30.menu.FlashMode.opi.build.flash_freq=80m

dydk1a_mpv30.menu.FlashSize.4M=4MB (32Mb)
dydk1a_mpv30.menu.FlashSize.4M.build.flash_size=4MB
dydk1a_mpv30.menu.FlashSize.8M=8MB (64Mb)
dydk1a_mpv30.menu.FlashSize.8M.build.flash_size=8MB
dydk1a_mpv30.menu.FlashSize.8M.build.partitions=default_8MB
dydk1a_mpv30.menu.FlashSize.16M=16MB (128Mb)
dydk1a_mpv30.menu.FlashSize.16M.build.flash_size=16MB
#dydk1a_mpv30.menu.FlashSize.32M=32MB (256Mb)
#dydk1a_mpv30.menu.FlashSize.32M.build.flash_size=32MB
dydk1a_mpv30.menu.FlashSize.32M.build.partitions=app5M_fat24M_32MB #yeni geldi

